package lesson10.militarybase;

public class Task {
    //Вы - разработчик информационной системы для американской военной базы. Как и всякая военная база, ваша база находится в пустыне и огорожена пятиметровым забором. У каждой дыры в заборе установлен автоматизированный КПП. Вся информация о перемещении личного состава, транспортных средств и материальных ценностей через эти КПП поступает в информационную систему базы. Ваша задача на сегодня - разработать модуль учета всех перемещений через эти КПП - из внешнего мира на территорию базы и обратно.
    //1. Для этого вы разработали класс Base, а в нем - четыре переменные:
    //
    //int people_on_base; - количество людей на территории базы;
    //int vehicles_on_base; - количество транспортных средств на территории базы;
    //double petrol_on_base; - количество бензина на местной "заправке" (в литрах);
    //double goods_on_base; - количество "груза" - различных материальных ценностей (в тоннах)...



// Продолжение задания в папке с проектом.
}
